<script lang="ts">
  import * as d3 from 'd3';

  import Linechart from '../components/linechart.svelte';
  import Typography from '../components/typography.svelte';

  import movements from '../assets/data/event_all.csv';
  import formatMovementData from '../utils/formatMovementToLinedata';
  import TopicOrderedList from '../components/summary/topic-ordered-list.svelte';
  import Topic from '../components/summary/topic.svelte';
  import TopicHead from '../components/summary/topic-head.svelte';
  import TopicParagraph from '../components/summary/topic-paragraph.svelte';
  import SummaryTimeline from '../components/summary/summary-timeline.svelte';
  import Event from '../components/summary/event.svelte';
  import { routes } from '../components/nav.svelte';

  const linedata = formatMovementData(movements);
  let width = 1024,
    lcHeight = 320,
    margin = { top: 50, right: 30, bottom: 50, left: 30 };
  $: Y = d3
    .scaleLinear()
    .domain([0, d3.max(linedata, (d) => d.y)])
    .range([lcHeight - margin.bottom, margin.top]);
  $: X = d3
    .scaleTime()
    .domain([new Date(2019, 11, 1), d3.max(linedata, (d) => d.x)])
    .range([margin.left, width - margin.right]);

  const explore = routes[0];
</script>

<div
  class="w-full h-full flex flex-col justify-center items-center bg-gradient-to-b from-blue-dark to-mint via-blue-light py-24"
>
  <Typography as="h1" class="text-center text-white">
    สรุปภาพรวม<br />
    Civil Movement 2020
  </Typography>
  <div
    class="w-full max-w-5xl h-80"
    bind:clientWidth={width}
    bind:clientHeight={lcHeight}
  >
    <Linechart
      data={linedata}
      {width}
      height={lcHeight}
      {margin}
      {X}
      {Y}
      axis
    />
  </div>
  <Topic>
    <TopicHead>แบ่งเป็น 2 ฝ่ายหลัก ๆ</TopicHead>
    <TopicOrderedList>
      <li>ฝ่ายเรียกร้องประชาธิปไตย</li>
      <li>ฝ่ายอนุรักษ์นิยมปกป้องสถาบันพระมหากษัตริย์</li>
    </TopicOrderedList>
  </Topic>
  <Topic>
    <TopicHead>ประเด็นที่เรียกร้อง</TopicHead>
    <TopicOrderedList>
      <li>เรียกร้องความยุติธรรม</li>
      <li>ขับไล่รัฐบาล</li>
      <li>แก้ไขรัฐธรรมนูญ</li>
      <li>ปฏิรูปสถาบันพระมหากษัตริย์</li>
      <li>
        ปกป้องสถาบันพระมหากษัตริย์<br />และประเด็นย่อยอื่น ๆ เช่น เพศ การศึกษา
        ศาสนา สิ่งแวดล้อม สวัสดิการ<br />รำลึกเหตุการณ์สำคัญ ฯลฯ
      </li>
    </TopicOrderedList>
  </Topic>
  <Topic>
    <TopicHead>ลักษณะของ Movement</TopicHead>
    <TopicParagraph>
      มีทั้งจัดเวทีใหญ่ + เวทีย่อย และแบบดาวกระจายจัดชุมนุมทั่วประเทศ
      ส่วนมากเป็นลักษณะการแสดงออกเชิงสัญลักษณ์ (การใช้ถ้อยคำ , การชู 3 นิ้ว ฯลฯ)
      การพูดปราศรัยประเด็นต่าง ๆ การอ่านแถลงการณ์ รวมถึงกิจกรรมลักษณะอื่น ๆ เช่น
      กิจกรรมวิ่ง การแสดง Parody (ล้อเลียน) การแสดงดนตรี การแสดงพิธีกรรม
      การตั้งวงรับประทานอาหารและเครื่องดื่ม การฝังหมุดคณะราษฎร ฯลฯ
    </TopicParagraph>
  </Topic>
  <Topic>
    <TopicHead>ระยะเวลาของ Movement</TopicHead>
    <TopicParagraph>
      ส่วนมากเป็นแบบ Flash mob จบใน 1 วัน หรือหากมีค้างคืน ก็ไม่เกิน 1 คืน
      และทำกิจกรรมต่อเนื่องในวันรุ่งขึ้น ยังไม่มีการชุมนุมระยะยาว
    </TopicParagraph>
  </Topic>
  <Topic>
    <TopicHead>แนวโน้มความถี่ของการเกิด Movement</TopicHead>
    <TopicParagraph>
      เหตุการณ์ตัวเร่งที่ทำให้ปริมาณม็อบของฝั่งประชาธิปไตยเพิ่มขึ้น =
      การใช้ความรุนแรงจากภาครัฐ (สลายการชุมนุม)
      และการใช้อำนาจทางกระบวนกฎหมายจากรัฐ (คดียุบพรรค ไล่จับแกนนำ
      ไล่ใช้โทษทางอาญา หมวดความมั่นคง ฯลฯ)
      เหตุการณ์ตัวเร่งที่ทำให้ปริมาณม็อบของฝั่งอนุรักษ์นิยมเพิ่มขึ้น =
      การแตะต้องสถาบันประเด็นเรื่องพระมหากษัตริย์ (ทั้งการปราศรัย
      และการแสดงออกเชิงสัญลักษณ์)
    </TopicParagraph>
  </Topic>
  <Topic>
    <TopicHead>สาเหตุหลักของความรุนแรง</TopicHead>
    <TopicParagraph>เกิดจาก 2 สาเหตุหลัก คือ</TopicParagraph>
    <TopicOrderedList>
      <li>การใช้อำนาจรัฐ - สลายการชุมนุม</li>
      <li>
        การปะทะกันของมวลชน (ฝั่งคณะราษฎร VS
        ฝั่งมวลชนเสื้อเหลือง)รวมถึงมีความพยายามในการสร้างสถานการณ์ความรุนแรงขึ้นจากบุคคลบางกลุ่ม
        (เช่น การใช้อาวุธปืน อาวุธระเบิด)
      </li>
    </TopicOrderedList>
  </Topic>
  <Topic>
    <TopicHead>ความเคลื่อนไหวแบ่งเป็น 4 ช่วงหลัก ๆ</TopicHead>
  </Topic>
  <div class="w-full max-w-5xl mb-96">
    <SummaryTimeline />
  </div>
  <Event
    graphics={'flashmob'}
    title="แฟลชม็อบช่วงต้นปี (จากเหตุยุบพรรคอนาคตใหม่)"
  >
    {`
ปฏิเสธไม่ได้ว่า การชงเรื่องของคณะกรรมการการเลือกตั้ง (กกต.) และคำวินิจฉัยของศาลรัฐธรรมนูญให้ยุบพรรค อนาคตใหม่ และตัดสิทธิ์กรรมการบริหารพรรค) ส่งผลต่อการ ออกมาแสดงพลังของประชาชน ซึ่งส่วนมากเป็นเยาวชน คนรุ่นใหม่ ในการเรียกร้องหาสิ่งสำคัญพื้นฐานที่สุดในสังคม นั่นคือ “ความยุติธรรม”

เหตุการณ์ต่าง ๆ ที่เกิดขึ้นกับพรรคอนาคตใหม่ ซึ่งมีฐานเสียง ส่วนมากเป็นเยาวชนคนรุ่นใหม่ที่พึ่งมีสิทธิเลือกตั้งในการเลือกตั้งเมื่อช่วงเดือนมีนาคม ปี พ.ศ. 2562 เป็นครั้งแรก ถือเป็นการผลัก อุณหภูมิทางการเมืองที่คุกรุ่นออกจากรัฐสภาลงสู่ท้องถนนอย่าง ชัดเจน ประกอบกับการบริหารงานและภาพลักษณ์ของรัฐบาล ที่ไม่ดีเพียงพอ และที่มาของรัฐบาลจากกลไกที่สนับสนุนการ สืบทอดอำนาจ อันบิดผันหลักการประชาธิปไตย ทำให้กระแสการ ต่อต้านรัฐบาลและการแสดงพลังของเยาวชนทวีความเข้มข้น อย่างเต็มเปี่ยมมากยิ่งขึ้นเรื่อย ๆ

ผลพวงจากการแฟลชม็อบต่าง ๆ ที่เกิดขึ้น ไม่เพียงแสดงให้เห็น ถึงพลังและความคิดเห็นของของคนรุ่นใหม่เท่านั้น แต่ยังทำให้ประเด็นปัญหาต่าง ๆ ที่แทรกซึมอยู่ในสังคม ได้ถูกหยิบยกขึ้นมา พูดถึงในที่สาธารณะอีกด้วย
`}
  </Event>
  <Event graphics={'freeyouth'} title="อิทธิพลของม็อบ “ปลดแอก”">
    {`
จากกรณีการบริหารงานที่ไม่มีประสิทธิภาพของรัฐบาลพลเอก ประยุทธ์ ในกรณี COVID-19 ทำให้เกิดกรณีทหารอียิปต์ที่มีเชื้อ หลุดเข้ามาพำนักที่ จ.ระยอง รวมถึงกรณีสภาพเศรษฐกิจย่ำแย่ ถดถอย จากมาตรการป้องกันและควบคุมโรคของรัฐบาล จนมี ประชาชนหลายคนตัดสินใจจบชีวิตของตนเองลง การใช้ พระราชกำหนดการบริหารราชการในสถานการณ์ฉุกเฉิน พ.ศ. 2548 โดยอ้างเหตุ COVID-19 เพื่อเป็นเครื่องมือในการคุกคาม และปิดปากประชาชนที่ออกมาแสดงความคิดเห็นทางการเมืองในกรณีต่าง ๆ เช่น กรณีอุ้มหาย “วันเฉลิม สัตย์ศักดิ์สิทธิ์” ผู้ลี้ภัย ทางการเมืองชาวไทยในประเทศกัมพูชา รวมไปถึงที่มาของ รัฐบาลอันสะท้อนถึงสืบทอดอำนาจผ่านกลไกในรัฐธรรมนูญ และกรณีอื่น ๆ ที่สะท้อนให้เห็นถึงความไม่ยุติธรรม ความ เหลื่อมล้ำ และความไม่เท่าเทียมกันในสังคม

เรื่องต่าง ๆ เหล่านี้ เป็นสาเหตุสำคัญที่ทำให้เกิดการออกมาแสดง พลังของประชาชนอีกระลอกหนึ่ง โดยมีข้อเรียกร้องหลักเพื่อขับไล่ รัฐบาลทหารแปลงรูปนี้ออกไป รวมถึงร่วมกันแสดงเจตจำนงว่า จะต้องเกิดการแก้กลไกรัฐธรรมนูญเพื่อไม่ให้เกิดการสืบทอด อำนาจได้ และเรียกร้องหลักประกันแก่ประชาชนที่ว่า จะต้องไม่มี การใช้มาตรการใด ไม่ว่าจะเป็นทางกฎหมายและอำนาจรัฐ ในการคุกคามผู้ออกมาแสดงความคิดเห็นทางการเมืองอีก

นอกจากนี้ การเกิดขึ้นของม็อบ “เยาวชนปลดแอก”  เมื่อวันที่ 18 กรกฎาคม 2563 ซึ่งถือเป็นการชุมนุมใหญ่ที่สุดในรอบ 6 ปี ยังเป็นผลให้เกิดเหตุการณ์สำคัญ ๆ อีกมากมาย ไม่ว่าจะเป็น การรวมตัวของกลุ่ม “คณะประชาชนปลดแอก” การจัดม็อบของ กลุ่มเสรีเทยพลัส การจัดม็อบของกลุ่มนักเรียนเลว ฯลฯ ซึ่งล้วน ได้รับอิทธิพลมาจากนามแห่ง “การปลดแอก” จากการกดขี่ของ โครงสร้างอันไม่เป็นธรรมทั้งหลายในสังคม ไม่ว่าจะในเรื่องเพศ การศึกษา ชาติพันธุ์ ความเหลื่อมล้ำทางเศรษฐกิจ ฯลฯ
`}
  </Event>
  <Event graphics={'thammasat'} title="อิทธิพลของม็อบธรรมศาสตร์">
    {`
    “การปฏิรูปสถาบันพระมหากษัตริย์” เป็นประเด็นที่ผู้คนมักจะ ไม่กล้าพูดถึงมาโดยตลอด ทั้งนี้เนื่องจากข้อจำกัดทางบทบัญญัติ กฎหมายและสภาพสังคมที่ไม่เปิดโอกาสให้มีการถกเถียงเรื่องนี้ได้อย่างเปิดกว้างและปลอดภัย รวมไปถึงการสร้างบรรยากาศของ ความหวาดกลัวให้กับสังคมของรัฐ เพื่อทำให้ประชาชนไม่กล้า ที่จะพูดคุยกันในเรื่องนี้อย่างทั่วไป ไม่ว่าในทางใด ๆ ก็ตาม

แต่การชุมนุมที่มหาวิทยาลัยธรรมศาสตร์ รังสิต เมื่อวันที่ 19 ก.ย. 2563 คือ”การเปิดเพดาน” เรื่องสถาบันพระมหากษัตริย์อย่าง แท้จริง 10 ข้อเรียกร้องที่ถูกอ่านโดยตัวแทนแกนนำนักศึกษา ในนามกลุ่มแนวร่วม "ธรรมศาสตร์และการชุมนุม" ถือเป็นการ ส่งสัญญาณโดยตรงไปยังสถาบันพระมหากษัตริย์ว่า ประชาชน ต้องการความเปลี่ยนแปลงในเรื่องนี้อย่างเป็นรูปธรรม

รวมถึงเหตุการณ์อื่น ๆ หลังจากนั้น ไม่ว่าจะเป็นการ Surprise แบบเบิ้ม ๆ ด้วยการฝังหมุดคณะราษฎร และความพยายามใน การเดินขบวนไปยื่นข้อเรียกร้องเกี่ยวกับสถาบันกษัตริย์ 10 ข้อ ที่พระบรมมหาราชวัง ล้วนเป็นการทลายเพดานในการพูดถึงเรื่อง สถาบันพระมหากษัตริย์ในสังคมไทยอย่างแท้จริง
    `}
  </Event>
  <Event graphics={'people'} title="กลุ่มม็อบคณะราษฎร">
    {`
    การรวมตัวกันของประชาชนกลุ่มต่าง ๆ  (เช่น แนวร่วม ธรรมศาสตร์ เยาวชนปลดแอก นักเรียนเลว) จนเกิดเป็นชื่อ “คณะราษฎร” ถือเป็นการยกระดับการเคลื่อนไหวของประชาชน อีกครั้งหนึ่ง ถือเป็นการใช้นามที่สะท้อนว่า ความหวังจะได้มาซึ่ง ประชาธิปไตยยังคงอยู่ในหัวใจของคนไทยเสมอมา โดยมี ข้อเรียกร้องหลักในเรื่องการขับไล่นายกรัฐมนตรีและองคาพยพ ทั้งหลาย เรื่องการร่างรัฐธรรมนูญใหม่ของประชาชน และเรื่อง การปฏิรูปสถาบันพระมหากษัตริย์ให้อยู่ภายใต้รัฐธรรมนูญ

แม้แรกเริ่ม คณะราษฎรจะถูกจัดตั้งขึ้นมาเป็นกลุ่มเพียงกลุ่มเดียว มีแกนนำที่ระบุตัวได้ชัดเจน แต่ภายหลังเหตุการณ์สลายการ ชุมนุมที่บริเวณหน้าทำเนียบรัฐบาล และบริเวณแยกปทุมวัน นามของคณะราษฎรก็ถูกกระจายไปยังประชาชนทุกคน ตามที่ แกนนำคณะราษฎรได้ลั่นวาจาไว้ว่า “ทุกคนคือแกนนำ” ก่อให้เกิด การเคลื่อนไหวของประชาชนในทุกส่วนของประเทศอย่าง พร้อมเพรียงกัน

อย่างไรก็ตาม การยกระดับประเด็นแห่งการชุมนุมในเรื่องสถาบัน พระมหากษัตริย์ครั้งนี้ ทำให้เกิดความเห็นขัดแย้งจากมวลชน อีกฝั่งหนึ่ง ที่ออกมาเคลื่อนไหวเพื่อแสดงพลังต่อต้านมวลชน ฝ่ายคณะราษฎรเช่นกัน มวลชนกลุ่มนี้มักเรียกตัวเองว่าเป็นฝั่ง “ปกป้องสถาบันพระมหากษัตริย์” และมักใช้ “สีเหลือง” เป็น สัญลักษณ์ในการต่อสู้เพื่อปกป้องสิ่งที่พวกเขาเชื่อว่าเป็นสถาบัน หลักของประเทศ อันได้แก่ ชาติ ศาสนา และพระมหากษัตริย์ รวมถึงได้มีจุดยืนสำคัญในเรื่องการแสดงความจงรักภักดีต่อ สถาบันพระมหากษัตริย์อย่างพร้อมเพรียงกันอีกด้วย
    `}
  </Event>
  <Event title="กลุ่มม็อบอื่น ๆ">
    {`
    นอกจากบรรดาการเคลื่อนไหวของประชาชนไทยทั้งในและนอก ประเทศที่มีขึ้นเพื่อเรียกร้องประชาธิปไตยแท้จริงให้เกิดขึ้นในสังคมไทยแล้ว ยังมีการเคลื่อนไหวอื่น ๆ ของประชาชนไทยใน ประเด็นเฉพาะเรื่องต่าง ๆ ที่เกิดขึ้นด้วย เช่น 
    `}
  </Event>
  <Event graphics={'wanchalearm'} sub>
    {`+ การเรียกร้องความเป็นธรรมให้กับนาย วันเฉลิม สัตย์ศักดิ์สิทธิ์ หรือ ต้าร์ ผู้ลี้ภัย ทางการเมืองชาวไทยที่ถูกอุ้มหายไปจาก บริเวณหน้าอาคารพักอาศัยในกรุงพนมเปญ ประเทศกัมพูชา`}
  </Event>
  <Event graphics={'88year'} sub>
    {`+ การรำลึกวันครบรอบ 88 ปี วันเปลี่ยนแปลงการปกครองของประเทศไทย`}
  </Event>
  <Event graphics={'red shirt'} sub>
    {`+ การรำลึกเหตุการณ์สลายการชุมนุมและ ความรุนแรงที่เกิดขึ้นกับแนวร่วม ประชาธิปไตยต่อต้านเผด็จการแห่งชาติ (นปช.) หรือกลุ่มคนเสื้อแดง เมื่อปี พ.ศ. 2553`}
  </Event>
  <Event graphics={'welfare'} sub>
    {`+ การเคลื่อนไหวเพื่อเรียกร้องสวัสดิการต่าง ๆ จากรัฐ เช่น สิทธิของผู้ประกอบอาชีพ สิทธิของผู้พิการ สิทธิในเงินประกันสังคม เป็นต้น`}
  </Event>
  <Event graphics={'pm25'} sub>
    {`+ การเคลื่อนไหวเพื่อเรียกร้องในประเด็น เกี่ยวกับสิ่งแวดล้อม เช่น ปัญหา PM 2.5 ปัญหาการสร้างเหมือง ปัญหาโครงการเขตอุตสาหกรรมพิเศษ เป็นต้น`}
  </Event>
  <Event graphics={'ilaw'} sub>
    {`+ การเคลื่อนไหวเพื่อให้ได้มาซึ่งร่าง รัฐธรรมนูญใหม่ของประชาชนจากทาง โครงการอินเทอร์เน็ตเพื่อประชาชน หรือ iLaw รวมถึงเครือข่ายภาคประชาชนและ ภาคประชาสังคมอื่น ๆ`}
  </Event>
  <Event graphics={'abortion'} sub>
    {`+ การเคลื่อนไหวเพื่อเรียกร้องสิทธิและ ความเป็นธรรมของผู้หญิง`}
  </Event>
  <Event graphics={'antionechina'} sub>
    {`+ การเคลื่อนไหวเพื่อสนับสนุน Movement ของชาวต่างชาติ เช่น กลุ่ม Anti One China TH ที่สนับสนุนการเคลื่อนไหวเพื่อเรียกร้อง ประชาธิปไตยของคนฮ่องกง`}
  </Event>
  <Event graphics={'foreign'} sub>
    {`+ นอกจากนี้ยังมีชาวต่างชาติบางส่วนที่มี มุมมองสนับสนุนการเคลื่อนไหวของ ประชาชนในประเทศไทย ก็ได้ออกมาแสดง จุดยืนเช่นกัน เช่น กรณีของนายโจชัว หว่อง หรือกลุ่มสมาชิกวุฒิสภาแห่งประเทศ สหรัฐอเมริกา เป็นต้น`}
  </Event>
  <a
    href={explore.path}
    class="my-60 w-80 h-14 rounded-full bg-white bg-opacity-50 flex justify-center items-center font-heading font-normal"
  >
    สำรวจเอง
  </a>
</div>
