<script lang="ts">
  import * as d3 from 'd3';

  import Linechart from '../components/linechart.svelte';
  import Typography from '../components/typography.svelte';

  import movements from '../assets/data/event_all.csv';
  import formatMovementData from '../utils/formatMovementToLinedata';
  import TopicOrderedList from '../components/summary/topic-ordered-list.svelte';
  import Topic from '../components/summary/topic.svelte';
  import TopicHead from '../components/summary/topic-head.svelte';
  import TopicParagraph from '../components/summary/topic-paragraph.svelte';
  import SummaryTimeline from '../components/summary/summary-timeline.svelte';
  import Event from '../components/summary/event.svelte';
  import { routes } from '../components/nav.svelte';
  import Sharer from '../components/sharer.svelte';
  import IconBulletPoint from '../components/summary/icon-bullet-point.svelte';

  const linedata = formatMovementData(movements);
  let width = 1024,
    lcHeight = 320,
    margin = { top: 50, right: 30, bottom: 50, left: 30 };
  $: Y = d3
    .scaleLinear()
    .domain([0, d3.max(linedata, (d) => d.y)])
    .range([lcHeight - margin.bottom, margin.top]);
  $: X = d3
    .scaleTime()
    .domain([new Date(2019, 11, 1), d3.max(linedata, (d) => d.x)])
    .range([margin.left, width - margin.right]);

  const explore = routes[0];
</script>

<div class="w-full h-full flex flex-col justify-center items-center">
  <div
    class="w-full h-full flex flex-col justify-center items-center bg-gradient-to-b from-blue-dark to-blue-light pt-24 px-4"
  >
    <Typography as="h1" bold class="text-center text-white">
      สรุปภาพรวม<br />
      Civil Movement 2020
    </Typography>
    <div
      class="w-full max-w-5xl h-80"
      bind:clientWidth={width}
      bind:clientHeight={lcHeight}
    >
      <Linechart
        data={linedata}
        {width}
        height={lcHeight}
        {margin}
        {X}
        {Y}
        axis
      />
    </div>
    <Topic>
      <TopicHead>แบ่งเป็น 2 ฝ่ายหลัก ๆ</TopicHead>
      <TopicOrderedList>
        <li>ฝ่ายเรียกร้องประชาธิปไตย</li>
        <li>ฝ่ายอนุรักษ์นิยมปกป้องสถาบันพระมหากษัตริย์</li>
      </TopicOrderedList>
    </Topic>
    <Topic>
      <TopicHead>ประเด็นที่เรียกร้อง</TopicHead>
      <TopicOrderedList>
        <li>เรียกร้องความยุติธรรม</li>
        <li>ขับไล่รัฐบาล</li>
        <li>แก้ไขรัฐธรรมนูญ</li>
        <li>ปฏิรูปสถาบันพระมหากษัตริย์</li>
        <li>
          ปกป้องสถาบันพระมหากษัตริย์<br />และประเด็นย่อยอื่น ๆ เช่น เพศ การศึกษา
          ศาสนา สิ่งแวดล้อม สวัสดิการ<br />รำลึกเหตุการณ์สำคัญ ฯลฯ
        </li>
      </TopicOrderedList>
    </Topic>
    <Topic>
      <TopicHead>ลักษณะของ Movement</TopicHead>
      <TopicParagraph>
        มีทั้งจัดเวทีใหญ่ + เวทีย่อย และแบบดาวกระจายจัดชุมนุมทั่วประเทศ
        ส่วนมากเป็นลักษณะการแสดงออกเชิงสัญลักษณ์ (การใช้ถ้อยคำ การชู 3 นิ้ว ฯลฯ)
        การพูดปราศรัยประเด็นต่าง ๆ การอ่านแถลงการณ์ รวมถึงกิจกรรมลักษณะอื่น ๆ
        เช่น กิจกรรมวิ่ง การแสดง Parody (ล้อเลียน) การแสดงดนตรี การแสดงพิธีกรรม
        การตั้งวงรับประทานอาหารและเครื่องดื่ม การฝังหมุดคณะราษฎร ฯลฯ
      </TopicParagraph>
    </Topic>
    <Topic>
      <TopicHead>ระยะเวลาของ Movement</TopicHead>
      <TopicParagraph>
        ส่วนมากเป็นแบบ Flash mob จบใน 1 วัน หรือหากมีค้างคืน ก็ไม่เกิน 1 คืน
        และทำกิจกรรมต่อเนื่องในวันรุ่งขึ้น ยังไม่มีการชุมนุมระยะยาว
      </TopicParagraph>
    </Topic>
    <Topic>
      <TopicHead>แนวโน้มความถี่ของการเกิด Movement</TopicHead>
      <TopicParagraph>
        <ol class="list-decimal list-inside">
          <li>
            เหตุการณ์ตัวเร่งที่ทำให้ปริมาณม็อบของฝั่งประชาธิปไตยเพิ่มขึ้น =
            การใช้ความรุนแรงจากภาครัฐ (สลายการชุมนุม)
            และการใช้อำนาจทางกฎหมายจากรัฐ (คดียุบพรรค ไล่จับแกนนำ ใช้กฏหมายอาญา
            หมวดความมั่นคง ฯลฯ)
          </li>
          <li>
            เหตุการณ์ตัวเร่งที่ทำให้ปริมาณม็อบของฝั่งอนุรักษ์นิยมเพิ่มขึ้น =
            การแตะต้องสถาบันประเด็นเรื่องพระมหากษัตริย์ (ทั้งการปราศรัย
            และการแสดงออกเชิงสัญลักษณ์)
          </li>
        </ol>
      </TopicParagraph>
    </Topic>
    <Topic>
      <TopicHead>สาเหตุหลักของความรุนแรง</TopicHead>
      <TopicParagraph>เกิดจาก 2 สาเหตุหลัก คือ</TopicParagraph>
      <TopicOrderedList>
        <li>การใช้อำนาจรัฐ - สลายการชุมนุม</li>
        <div class="flex">
          <div
            class="flex flex-col md:flex-row space-y-2 md:space-y-0 md:space-x-2 my-6 mx-auto"
          >
            <IconBulletPoint label="การใช้กำลังของเจ้าหน้าที่">
              <svg
                width="22"
                height="27"
                viewBox="0 0 22 27"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M6.70712 17.24L3.86712 14.4C3.20712 13.74 2.13712 13.74 1.48712 14.4C0.907117 14.98 0.827117 15.9 1.30712 16.57L5.58712 22.58C7.24712 24.76 9.83712 26.04 12.5871 26.04H14.4171C18.4671 26.04 21.7471 22.76 21.7471 18.71V11.74V5.5C21.7471 4.69 21.0871 4.03 20.2771 4.03C19.4671 4.03 18.8071 4.69 18.8071 5.5V11.73H17.7071V2.93C17.7071 2.12 17.0471 1.46 16.2371 1.46C15.4271 1.46 14.7671 2.12 14.7671 2.93V11.73H13.6671V1.47C13.6671 0.66 13.0071 0 12.1971 0C11.3871 0 10.7271 0.66 10.7271 1.47V11.74H9.62712V3.3C9.62712 2.49 8.96712 1.83 8.15712 1.83C7.34712 1.83 6.68712 2.49 6.68712 3.3V17.24H6.70712Z"
                  fill="black"
                />
              </svg>
            </IconBulletPoint>
            <IconBulletPoint label="ฉีดน้ำแรงดันสูง">
              <svg
                width="52"
                height="19"
                viewBox="0 0 52 19"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M35.83 1.93005H3.24L0 3.83005H35.83V1.93005Z"
                  fill="black"
                />
                <path
                  d="M32.0898 0H34.9898V1.93H30.0498L32.0898 0Z"
                  fill="black"
                />
                <path
                  d="M45.12 18.38C46.7161 18.38 48.01 17.0861 48.01 15.49C48.01 13.8939 46.7161 12.6 45.12 12.6C43.5239 12.6 42.23 13.8939 42.23 15.49C42.23 17.0861 43.5239 18.38 45.12 18.38Z"
                  fill="black"
                />
                <path
                  d="M17.91 18.38C19.5061 18.38 20.8 17.0861 20.8 15.49C20.8 13.8939 19.5061 12.6 17.91 12.6C16.3139 12.6 15.02 13.8939 15.02 15.49C15.02 17.0861 16.3139 18.38 17.91 18.38Z"
                  fill="black"
                />
                <path
                  d="M8.57018 18.38C10.1663 18.38 11.4602 17.0861 11.4602 15.49C11.4602 13.8939 10.1663 12.6 8.57018 12.6C6.97407 12.6 5.68018 13.8939 5.68018 15.49C5.68018 17.0861 6.97407 18.38 8.57018 18.38Z"
                  fill="black"
                />
                <path
                  d="M12.7302 1.21997H10.1802V1.91997H12.7302V1.21997Z"
                  fill="black"
                />
                <path
                  d="M12.9302 0.810059H9.99023V1.23006H12.9302V0.810059Z"
                  fill="black"
                />
                <path
                  d="M0 3.82996V16.28H35.83V3.82996H0ZM25.89 7.11996H7.48V5.99996H25.9V7.11996H25.89Z"
                  fill="black"
                />
                <path
                  d="M49.4799 1.21997H36.9399V15.23H51.3699V8.37997L49.4799 1.21997ZM46.1599 5.99997V1.92997H49.2599L50.7599 7.60997L46.1599 5.99997Z"
                  fill="black"
                />
              </svg>
            </IconBulletPoint>
            <IconBulletPoint label="การใช้กำลังของเจ้าหน้าที่">
              <svg
                width="18"
                height="25"
                viewBox="0 0 18 25"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.02 11.51L8.71 2.21997L2.4 11.51C1.52 12.76 1 14.28 1 15.93C1 20.19 4.45 23.64 8.71 23.64C12.97 23.64 16.42 20.19 16.42 15.93C16.42 14.28 15.9 12.76 15.02 11.51Z"
                  stroke="black"
                  stroke-width="2"
                  stroke-miterlimit="10"
                />
              </svg>
            </IconBulletPoint>
            <IconBulletPoint label="น้ำผสมสี">
              <svg
                width="22"
                height="27"
                viewBox="0 0 22 27"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M6.70712 17.24L3.86712 14.4C3.20712 13.74 2.13712 13.74 1.48712 14.4C0.907117 14.98 0.827117 15.9 1.30712 16.57L5.58712 22.58C7.24712 24.76 9.83712 26.04 12.5871 26.04H14.4171C18.4671 26.04 21.7471 22.76 21.7471 18.71V11.74V5.5C21.7471 4.69 21.0871 4.03 20.2771 4.03C19.4671 4.03 18.8071 4.69 18.8071 5.5V11.73H17.7071V2.93C17.7071 2.12 17.0471 1.46 16.2371 1.46C15.4271 1.46 14.7671 2.12 14.7671 2.93V11.73H13.6671V1.47C13.6671 0.66 13.0071 0 12.1971 0C11.3871 0 10.7271 0.66 10.7271 1.47V11.74H9.62712V3.3C9.62712 2.49 8.96712 1.83 8.15712 1.83C7.34712 1.83 6.68712 2.49 6.68712 3.3V17.24H6.70712Z"
                  fill="black"
                />
              </svg>
            </IconBulletPoint>
            <IconBulletPoint label="น้ำผสมแก๊ซน้ำตา">
              <svg
                width="28"
                height="16"
                viewBox="0 0 28 16"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M13.63 0C7.8 0 2.73 3.17 0 7.88C2.73 12.59 7.8 15.76 13.63 15.76C19.46 15.76 24.54 12.59 27.26 7.88C24.54 3.17 19.46 0 13.63 0ZM13.63 14.11C10.19 14.11 7.4 11.32 7.4 7.88C7.4 4.44 10.19 1.65 13.63 1.65C17.07 1.65 19.86 4.44 19.86 7.88C19.86 11.32 17.07 14.11 13.63 14.11Z"
                  fill="black"
                />
              </svg>
            </IconBulletPoint>
            <IconBulletPoint label="กระสุนยาง">
              <svg
                width="29"
                height="9"
                viewBox="0 0 29 9"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M28.09 4.38C28.09 1.96 20.46 0 16.36 0H0V8.77H16.36C20.46 8.77 28.09 6.8 28.09 4.38Z"
                  fill="black"
                />
              </svg>
            </IconBulletPoint>
          </div>
        </div>
        <li>
          การปะทะกันของมวลชน (ฝั่งคณะราษฎร vs ฝั่งมวลชนเสื้อเหลือง)
          รวมถึงมีความพยายามในการสร้างสถานการณ์ความรุนแรงขึ้นจากบุคคลบางกลุ่ม
          (เช่น การใช้อาวุธปืน อาวุธระเบิด)
        </li>
      </TopicOrderedList>
    </Topic>
    <Topic>
      <TopicHead>ความเคลื่อนไหวแบ่งเป็น 4 ช่วงหลัก ๆ</TopicHead>
    </Topic>
  </div>
  <div
    class="w-full h-full flex flex-col justify-center items-center bg-gradient-to-b from-blue-light to-mint-light overflow-x-hidden"
  >
    <div class="w-full max-w-5xl mb-96">
      <SummaryTimeline />
    </div>
  </div>
  <div
    class="w-full h-full flex flex-col justify-center items-center bg-gradient-to-b from-mint-light to-mint pb-24"
  >
    <Event
      graphics={'flashmob'}
      title="แฟลชม็อบช่วงต้นปี (จากเหตุยุบพรรคอนาคตใหม่)"
      first
    >
      {`
ปฏิเสธไม่ได้ว่า การชงเรื่องของคณะกรรมการการเลือกตั้ง (กกต.) และคำวินิจฉัยของศาลรัฐธรรมนูญให้ยุบพรรคอนาคตใหม่ และตัดสิทธิ์กรรมการบริหารพรรค ส่งผลต่อการออกมาแสดงพลังของประชาชน ซึ่งส่วนมากเป็นเยาวชนคนรุ่นใหม่ ในการเรียกร้องหาสิ่งสำคัญพื้นฐานที่สุดในสังคม นั่นคือ “ความยุติธรรม”

เหตุการณ์ต่าง ๆ ที่เกิดขึ้นกับพรรคอนาคตใหม่ ซึ่งมีฐานเสียงส่วนมากเป็นเยาวชนคนรุ่นใหม่ที่พึ่งมีสิทธิเลือกตั้งในการเลือกตั้งเมื่อช่วงเดือนมีนาคม ปี พ.ศ. 2562 เป็นครั้งแรก ถือเป็นการผลักอุณหภูมิทางการเมืองที่คุกรุ่นออกจากรัฐสภาลงสู่ท้องถนนอย่างชัดเจน ประกอบกับการบริหารงานและภาพลักษณ์ของรัฐบาลที่ไม่ดีเพียงพอ และที่มาของรัฐบาลจากกลไกที่สนับสนุนการสืบทอดอำนาจ อันบิดผันหลักการประชาธิปไตย ทำให้กระแสการต่อต้านรัฐบาลและการแสดงพลังของเยาวชนทวีความเข้มข้นอย่างเต็มเปี่ยมมากยิ่งขึ้นเรื่อย ๆ

ผลพวงจากการแฟลชม็อบต่าง ๆ ที่เกิดขึ้น ไม่เพียงแสดงให้เห็นถึงพลังและความคิดเห็นของของคนรุ่นใหม่เท่านั้น แต่ยังทำให้ประเด็นปัญหาต่าง ๆ ที่แทรกซึมอยู่ในสังคม ได้ถูกหยิบยกขึ้นมาพูดถึงในที่สาธารณะอีกด้วย
`}
    </Event>
    <Event graphics={'freeyouth'} title="อิทธิพลของม็อบ “ปลดแอก”">
      {`
จากกรณีการบริหารงานที่ไม่มีประสิทธิภาพของรัฐบาลพลเอกประยุทธ์ ในกรณี COVID-19 ทำให้เกิดกรณีทหารอียิปต์ที่มีเชื้อหลุดเข้ามาพำนักที่ จ.ระยอง รวมถึงกรณีสภาพเศรษฐกิจย่ำแย่ ถดถอย จากมาตรการป้องกันและควบคุมโรคของรัฐบาล จนมีประชาชนหลายคนตัดสินใจจบชีวิตของตนเองลง การใช้พระราชกำหนดการบริหารราชการในสถานการณ์ฉุกเฉิน พ.ศ. 2548 โดยอ้างเหตุ COVID-19 เพื่อเป็นเครื่องมือในการคุกคามและปิดปากประชาชนที่ออกมาแสดงความคิดเห็นทางการเมืองในกรณีต่าง ๆ เช่น กรณีอุ้มหาย “วันเฉลิม สัตย์ศักดิ์สิทธิ์” ผู้ลี้ภัยทางการเมืองชาวไทยในประเทศกัมพูชา รวมไปถึงที่มาของรัฐบาลอันสะท้อนถึงสืบทอดอำนาจผ่านกลไกในรัฐธรรมนูญ และกรณีอื่น ๆ ที่สะท้อนให้เห็นถึงความไม่ยุติธรรม ความเหลื่อมล้ำ และความไม่เท่าเทียมกันในสังคม

เรื่องต่าง ๆ เหล่านี้ เป็นสาเหตุสำคัญที่ทำให้เกิดการออกมาแสดงพลังของประชาชนอีกระลอกหนึ่ง โดยมีข้อเรียกร้องหลักเพื่อขับไล่รัฐบาลทหารแปลงรูปนี้ออกไป รวมถึงร่วมกันแสดงเจตจำนงว่า จะต้องเกิดการแก้กลไกรัฐธรรมนูญเพื่อไม่ให้เกิดการสืบทอดอำนาจได้ และเรียกร้องหลักประกันแก่ประชาชนที่ว่า จะต้องไม่มีการใช้มาตรการใด ไม่ว่าจะเป็นทางกฎหมายและอำนาจรัฐ ในการคุกคามผู้ออกมาแสดงความคิดเห็นทางการเมืองอีก

นอกจากนี้ การเกิดขึ้นของม็อบ “เยาวชนปลดแอก”  เมื่อวันที่ 18 กรกฎาคม 2563 ซึ่งถือเป็นการชุมนุมใหญ่ที่สุดในรอบ 6 ปี ยังเป็นผลให้เกิดเหตุการณ์สำคัญ ๆ อีกมากมาย ไม่ว่าจะเป็นการรวมตัวของกลุ่ม “คณะประชาชนปลดแอก” การจัดม็อบของกลุ่มเสรีเทยพลัส การจัดม็อบของกลุ่มนักเรียนเลว ฯลฯ ซึ่งล้วนได้รับอิทธิพลมาจากนามแห่ง “การปลดแอก” จากการกดขี่ของโครงสร้างอันไม่เป็นธรรมทั้งหลายในสังคม ไม่ว่าจะในเรื่องเพศ การศึกษา ชาติพันธุ์ ความเหลื่อมล้ำทางเศรษฐกิจ ฯลฯ
`}
    </Event>
    <Event graphics={'thammasat'} title="อิทธิพลของม็อบธรรมศาสตร์">
      {`
“การปฏิรูปสถาบันพระมหากษัตริย์” เป็นประเด็นที่ผู้คนมักจะไม่กล้าพูดถึงมาโดยตลอด ทั้งนี้เนื่องจากข้อจำกัดทางบทบัญญัติกฎหมายและสภาพสังคมที่ไม่เปิดโอกาสให้มีการถกเถียงเรื่องนี้ได้อย่างเปิดกว้างและปลอดภัย รวมไปถึงการสร้างบรรยากาศของความหวาดกลัวให้กับสังคมของรัฐ เพื่อทำให้ประชาชนไม่กล้าที่จะพูดคุยกันในเรื่องนี้อย่างทั่วไป ไม่ว่าในทางใด ๆ ก็ตาม

แต่การชุมนุมที่มหาวิทยาลัยธรรมศาสตร์ รังสิต เมื่อวันที่ 19 ก.ย. 2563 คือ "การเปิดเพดาน" เรื่องสถาบันพระมหากษัตริย์อย่างแท้จริง 10 ข้อเรียกร้องที่ถูกอ่านโดยตัวแทนแกนนำนักศึกษาในนามกลุ่มแนวร่วม "ธรรมศาสตร์และการชุมนุม" ถือเป็นการส่งสัญญาณโดยตรงไปยังสถาบันพระมหากษัตริย์ว่า ประชาชนต้องการความเปลี่ยนแปลงในเรื่องนี้อย่างเป็นรูปธรรม

รวมถึงเหตุการณ์อื่น ๆ หลังจากนั้น ไม่ว่าจะเป็นการฝังหมุดคณะราษฎร และความพยายามในการเดินขบวนไปยื่นข้อเรียกร้องเกี่ยวกับสถาบันกษัตริย์ 10 ข้อ ที่พระบรมมหาราชวัง ล้วนเป็นการทลายเพดานในการพูดถึงเรื่องสถาบันพระมหากษัตริย์ในสังคมไทยอย่างแท้จริง
    `}
    </Event>
    <Event graphics={'people'} title="กลุ่มม็อบคณะราษฎร">
      {`
การรวมตัวกันของประชาชนกลุ่มต่าง ๆ  (เช่น แนวร่วมธรรมศาสตร์ เยาวชนปลดแอก นักเรียนเลว) จนเกิดเป็นชื่อ “คณะราษฎร” ถือเป็นการยกระดับการเคลื่อนไหวของประชาชนอีกครั้งหนึ่ง ถือเป็นการใช้นามที่สะท้อนว่า ความหวังจะได้มาซึ่งประชาธิปไตยยังคงอยู่ในหัวใจของคนไทยเสมอมา โดยมีข้อเรียกร้องหลักในเรื่องการขับไล่นายกรัฐมนตรีและองคาพยพทั้งหลาย เรื่องการร่างรัฐธรรมนูญใหม่ของประชาชน และเรื่องการปฏิรูปสถาบันพระมหากษัตริย์ให้อยู่ภายใต้รัฐธรรมนูญ

แม้แรกเริ่ม คณะราษฎรจะถูกจัดตั้งขึ้นมาเป็นกลุ่มเพียงกลุ่มเดียว มีแกนนำที่ระบุตัวได้ชัดเจน แต่ภายหลังเหตุการณ์สลายการชุมนุมที่บริเวณหน้าทำเนียบรัฐบาล และบริเวณแยกปทุมวัน นามของคณะราษฎรก็ถูกกระจายไปยังประชาชนทุกคน ตามที่แกนนำคณะราษฎรได้ลั่นวาจาไว้ว่า “ทุกคนคือแกนนำ” ก่อให้เกิดการเคลื่อนไหวของประชาชนในทุกส่วนของประเทศอย่างพร้อมเพรียงกัน

อย่างไรก็ตาม การยกระดับประเด็นแห่งการชุมนุมในเรื่องสถาบันพระมหากษัตริย์ครั้งนี้ ทำให้เกิดความเห็นขัดแย้งจากมวลชนอีกฝั่งหนึ่ง ที่ออกมาเคลื่อนไหวเพื่อแสดงพลังต่อต้านมวลชนฝ่ายคณะราษฎรเช่นกัน มวลชนกลุ่มนี้มักเรียกตัวเองว่าเป็นฝั่ง “ปกป้องสถาบันพระมหากษัตริย์” และมักใช้ “สีเหลือง” เป็นสัญลักษณ์ในการต่อสู้เพื่อปกป้องสิ่งที่พวกเขาเชื่อว่าเป็นสถาบันหลักของประเทศ อันได้แก่ ชาติ ศาสนา และพระมหากษัตริย์ รวมถึงได้มีจุดยืนสำคัญในเรื่องการแสดงความจงรักภักดีต่อสถาบันพระมหากษัตริย์อย่างพร้อมเพรียงกันอีกด้วย
    `}
    </Event>
    <Event title="กลุ่มม็อบอื่น ๆ">
      {`
นอกจากบรรดาการเคลื่อนไหวของประชาชนไทยทั้งในและนอกประเทศที่มีขึ้นเพื่อเรียกร้องประชาธิปไตยแท้จริงให้เกิดขึ้นในสังคมไทยแล้ว ยังมีการเคลื่อนไหวอื่น ๆ ของประชาชนไทยในประเด็นเฉพาะเรื่องต่าง ๆ ที่เกิดขึ้นด้วย เช่น
    `}
    </Event>
    <Event graphics={'wanchalearm'} sub>
      {`+ การเรียกร้องความเป็นธรรมให้กับนายวันเฉลิม สัตย์ศักดิ์สิทธิ์ หรือ ต้าร์ ผู้ลี้ภัยทางการเมืองชาวไทยที่ถูกอุ้มหายไปจากบริเวณหน้าอาคารพักอาศัยในกรุงพนมเปญ ประเทศกัมพูชา`}
    </Event>
    <Event graphics={'88year'} sub>
      {`+ การรำลึกวันครบรอบ 88 ปี วันเปลี่ยนแปลงการปกครองของประเทศไทย`}
    </Event>
    <Event graphics={'red shirt'} sub>
      {`+ การรำลึกเหตุการณ์สลายการชุมนุมและความรุนแรงที่เกิดขึ้นกับแนวร่วมประชาธิปไตยต่อต้านเผด็จการแห่งชาติ (นปช.) หรือกลุ่มคนเสื้อแดง เมื่อปี พ.ศ. 2553`}
    </Event>
    <Event graphics={'welfare'} sub>
      {`+ การเคลื่อนไหวเพื่อเรียกร้องสวัสดิการต่าง ๆ จากรัฐ เช่น สิทธิของผู้ประกอบอาชีพ สิทธิของผู้พิการ สิทธิในเงินประกันสังคม เป็นต้น`}
    </Event>
    <Event graphics={'pm25'} sub>
      {`+ การเคลื่อนไหวเพื่อเรียกร้องในประเด็นเกี่ยวกับสิ่งแวดล้อม เช่น ปัญหา PM 2.5 ปัญหาการสร้างเหมือง ปัญหาโครงการเขตอุตสาหกรรมพิเศษ เป็นต้น`}
    </Event>
    <Event graphics={'ilaw'} sub>
      {`+ การเคลื่อนไหวเพื่อให้ได้มาซึ่งร่างรัฐธรรมนูญใหม่ของประชาชนจากทางโครงการอินเทอร์เน็ตเพื่อประชาชน หรือ iLaw รวมถึงเครือข่ายภาคประชาชนและภาคประชาสังคมอื่น ๆ`}
    </Event>
    <Event graphics={'abortion'} sub>
      {`+ การเคลื่อนไหวเพื่อเรียกร้องสิทธิและความเป็นธรรมของผู้หญิง`}
    </Event>
    <Event graphics={'antionechina'} sub>
      {`+ การเคลื่อนไหวเพื่อสนับสนุน Movement ของชาวต่างชาติ เช่น กลุ่ม Anti One China TH ที่สนับสนุนการเคลื่อนไหวเพื่อเรียกร้องประชาธิปไตยของคนฮ่องกง`}
    </Event>
    <Event graphics={'foreign'} sub>
      {`+ นอกจากนี้ยังมีชาวต่างชาติบางส่วนที่มีมุมมองสนับสนุนการเคลื่อนไหวของประชาชนในประเทศไทย ก็ได้ออกมาแสดงจุดยืนเช่นกัน เช่น กรณีของนายโจชัว หว่อง หรือกลุ่มสมาชิกวุฒิสภาแห่งประเทศสหรัฐอเมริกา เป็นต้น`}
    </Event>
    <a
      href={explore.path}
      class="my-40 w-80 h-14 rounded-full bg-white bg-opacity-50 flex justify-center items-center font-heading font-normal"
    >
      สำรวจเอง
    </a>
    <Sharer />
  </div>
</div>
